# 25: Pengaturan tampilan (display option) pada Python Pandas
# Import Modules

In [1]:
import pandas as pd

print(pd.__version__)

2.3.3

# Persiapan Data Frame

In [3]:
df = pd.read_csv('../DATTA/titanicfull.csv')
df

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S
...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,NaN,C
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,NaN,C
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,NaN,C
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,NaN,S

# Pengaturan tampilan

In [ ]:
pd.set_option('display.max_rows', 5)
pd.set_option('display.max_columns', 6)
pd.set_option('display.max_colwidth', 20)

df

In [ ]:
pd.reset_option('^display.', silent=True)

df

In [ ]:
pd.describe_option()

# 26: Membuat Data Frame dari hasil seleksi Spreadsheet
# Import Modules

In [ ]:
import pandas as pd

print(pd.__version__)

# Membuat Data Frame dari hasil seleksi Spreadsheet

In [ ]:
# df = pd.read_clipboard()
# df

# 27: Mengenal fungsi agregasi first() dan last()
# Import Modules

In [ ]:
import pandas as pd

print(pd.__version__)

# Persiapan Data Frame

In [ ]:
d = {'dokter':['Budi', 'Wati', 'Iwan', 'Budi', 'Budi', 'Wati'], 
     'pasien':['Abdul', 'Rahmat', 'Asep', 'Joko', 'Wiwin', 'Lisa']}

df = pd.DataFrame(d)
df

# Mengenal fungsi agregasi first() dan last()

In [ ]:
df.groupby('dokter')['pasien'].count().to_frame()

In [ ]:
df.groupby('dokter')['pasien'].first().to_frame()

In [ ]:
df.groupby('dokter')['pasien'].last().to_frame()

# 28: Mengenal explode dan implode list pada Data Frame
# Import Modules

In [ ]:
import pandas as pd

print(pd.__version__)

# Persiapan Data Frame

In [ ]:
d = {'Team':['DC', 'Marvel'], 
     'Heroes':[['Batman', 'Superman', 'Wonder Woman', 'Aquaman', 'Green Lantern', 'Shazam'], 
               ['Iron Man', 'Captain America', 'Ant-Man', 'Black Panther', 'Captain Marvel']]}

df = pd.DataFrame(d)
df

# Explode

In [ ]:
df1 = df.explode('Heroes')
df1

# Implode

In [ ]:
d = {'Team':['DC', 'Marvel']}
df2 = pd.DataFrame(d)
df2

In [ ]:
df2['Imploded'] = df1.groupby(df1.index)['Heroes'].agg(list)
df2